Documents/ЗаданиеНаДоставку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаданиеНаДоставку</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаданиеНаДоставку</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаДоставке</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавленыДанныеИзДругогоЗаданияНаДоставку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьКорректировкиГрузомест</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КроссДокинг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаказаВУТ11</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерWMS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Доставка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДоставки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументСборки</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаявкаНаВозврат</v8:Type>
								<v8:Type>cfg:DocumentRef.ОбъединениеГМВТЕ</v8:Type>
								<v8:Type>cfg:DocumentRef.СлужебнаяЗаписка</v8:Type>
								<v8:Type>cfg:DocumentRef.СборкаЗаказовПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Возврат</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Деньги</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маршрут</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МаршрутыДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отменено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоставкаПоказная</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДоставки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Возврат</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Деньги</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маршрут</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МаршрутыДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОчередьДоставки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Очередь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОчередьДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Маршруты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Маршрут</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МаршрутыДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Возвраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДоставки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументСборки</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаявкаНаВозврат</v8:Type>
								<v8:Type>cfg:DocumentRef.СлужебнаяЗаписка</v8:Type>
								<v8:Type>cfg:DocumentRef.СборкаЗаказовПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Возврат</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ЗаданиеНаДоставку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаданиеНаДоставку</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаданиеНаСборку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаВозврат</v8:Type>
						<v8:Type>cfg:DocumentRef.СборкаЗаказовПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыНаДоставке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаДоставке</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВозвращенногоТовара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаданиеНаДоставку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаДоставку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаВозврат</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/СтатусыОбъединений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыОбъединений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПроцессеОбъединения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеПогрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Погружено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТоварДоставляется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварПередан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварНеДоставлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносДоставки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ТранспортныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТранспортныеСредства</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортнаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоподъемность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вместимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ЗаданиеНаДоставку/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ЗаданиеНаДоставку 
	Движения.ЗаданиеНаДоставку.Записывать = Истина;
	Движения.ЗаданиеНаДоставку.Очистить(); 
	
	Для Каждого ТекСтрокаДоставка Из Доставка Цикл       
		
		Если НайтиКлиента(ТекСтрокаДоставка.Контрагент) Тогда  
			
			//+Белов А. 26.12.2024 #UT10-4983
			Если ТипЗнч(ТекСтрокаДоставка.ДокументСборки) = Тип("ДокументСсылка.ОбъединениеГМВТЕ") Тогда
				
				МассивСборок = Документы.ОбъединениеГМВТЕ.ПолучитьМассивСборокПоОбъединению(ТекСтрокаДоставка.ДокументСборки);
				
				Для каждого Сборка Из МассивСборок Цикл
					
					Движение = Движения.ЗаданиеНаДоставку.Добавить();
					Движение.Период = Дата;
					Движение.ЗаданиеНаСборку = Сборка;
					Движение.Водитель = Водитель;
					Движение.Контрагент =   ТекСтрокаДоставка.Контрагент;
					Движение.Количество = 1;  
					
				КонецЦикла;
				
			Иначе
			//-Белов А. 26.12.2024 #UT10-4983
				Движение = Движения.ЗаданиеНаДоставку.Добавить();
				Движение.Период = Дата;
				Движение.ЗаданиеНаСборку = ТекСтрокаДоставка.ДокументСборки;
				Движение.Водитель = Водитель;
				Движение.Контрагент =   ТекСтрокаДоставка.Контрагент;
				Движение.Количество = 1;  
				
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Строка Из Доставка Цикл
		
		Если Строка.Возврат тогда
			
			Если Строка.ДокументСборки.Статус = "Согласован"
				ИЛИ Строка.ДокументСборки.Статус = "Требуется экспертиза" Тогда
				
				ДокОб = СТрока.ДокументСборки.ПолучитьОбъект();
				ДокОб.Статус = "На доставке";
				ДокОб.ДополнительныеСвойства.Вставить("НеВыполнятьПроверкуНаДатыЗапрета",Истина);
				ДокОб.Записать();
				
			КонецЕсли;
			
		Иначе
			
			Если ТипЗнч(Строка.ДокументСборки) = Тип("ДокументСсылка.СлужебнаяЗаписка") И НЕ ЗначениеЗаполнено(Строка.ДокументСборки.ЗаданиеНаДоставку) Тогда
				
				ДокОб = СТрока.ДокументСборки.ПолучитьОбъект();
				ДокОб.ЗаданиеНаДоставку = Ссылка;
				ДокОб.Записать();   
				
			//+Белов А. 24.12.2024 #UT10-4983
			ИначеЕсли ТипЗнч(Строка.ДокументСборки) = Тип("ДокументСсылка.ОбъединениеГМВТЕ") И Строка.ДокументСборки.Статус = Перечисления.СтатусыОбъединений.ОжиданиеПогрузки Тогда
				
				ДокОб = Строка.ДокументСборки.ПолучитьОбъект();
				ДокОб.Статус = Перечисления.СтатусыОбъединений.Погружено;
				ДокОб.Записать(); 
				
			//-Белов А. 24.12.2024 #UT10-4983   			
			КонецЕсли;			
			
		КонецЕсли; 
		
	КонецЦикла;
	
	ЗапросПеренесенныхРТУ = Новый Запрос;
	ЗапросПеренесенныхРТУ.Текст =   
	"ВЫБРАТЬ
	|	ЗаданиеНаДоставкуДоставка.ДокументСборки
	|ПОМЕСТИТЬ ВТ_СборкиПоЗаданию
	|ИЗ
	|	Документ.ЗаданиеНаДоставку.Доставка КАК ЗаданиеНаДоставкуДоставка
	|ГДЕ
	|	ЗаданиеНаДоставкуДоставка.Ссылка = &Ссылка
	|	И ЗаданиеНаДоставкуДоставка.ДокументСборки ССЫЛКА Документ.СборкаЗаказовПокупателя 
	//+Кабанов А.В. 11.02.2025 # UT10-5127
	|	И НЕ ЗаданиеНаДоставкуДоставка.Отменено
	//-Кабанов А.В. 11.02.2025 # UT10-5127
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка КАК РТУ
	|ПОМЕСТИТЬ ВТ_РТУ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗначенияСвойствОбъектов.Объект КАК РТУ
	|	ИЗ
	|		РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|	ГДЕ
	|		ЗначенияСвойствОбъектов.Объект ССЫЛКА Документ.РеализацияТоваровУслуг
	|		И ЗначенияСвойствОбъектов.Значение = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ПереносДоставки)) КАК РТУДляПереноса
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ДокументыСборкиЗаказов КАК РеализацияТоваровУслугДокументыСборкиЗаказов
	|		ПО РТУДляПереноса.РТУ = РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка,
	|	Документ.ЗаданиеНаДоставку КАК ЗаданиеНаДоставку
	|ГДЕ
	|	РеализацияТоваровУслугДокументыСборкиЗаказов.ДокументСборки В
	|			(ВЫБРАТЬ
	|				ВТ_СборкиПоЗаданию.ДокументСборки
	|			ИЗ
	|				ВТ_СборкиПоЗаданию)
	|	И ЗаданиеНаДоставку.Ссылка = &Ссылка
	|	И РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.Дата < ЗаданиеНаДоставку.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_РТУ.РТУ,
	|	РазгрузкаАвтоГрузовыеМеста.Ссылка КАК Разгрузка
	|ПОМЕСТИТЬ ВТ_РТУ_Разгрузки
	|ИЗ
	|	ВТ_РТУ КАК ВТ_РТУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РазгрузкаАвто.ГрузовыеМеста КАК РазгрузкаАвтоГрузовыеМеста
	|		ПО ВТ_РТУ.РТУ = РазгрузкаАвтоГрузовыеМеста.РТУ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РТУ.РТУ,
	|	РазгрузкаАвтоГрузовыеМеста.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РТУ_Разгрузки.РТУ
	|ИЗ
	|	ВТ_РТУ_Разгрузки КАК ВТ_РТУ_Разгрузки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РТУ_Разгрузки.РТУ";
	//+КабановА.В. 25.03.2025 # UT10-5156 
	//|
	//|ИМЕЮЩИЕ
	//|	КОЛИЧЕСТВО(ВТ_РТУ_Разгрузки.Разгрузка) < 2";
	//+КабановА.В. 25.03.2025 # UT10-5156 
	ЗапросПеренесенныхРТУ.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапросаПеренесенныхРТУ = ЗапросПеренесенныхРТУ.Выполнить();
	
	Если Не РезультатЗапросаПеренесенныхРТУ.Пустой() Тогда
		
		ВыборкаЗапросаПеренесенныхРТУ = РезультатЗапросаПеренесенныхРТУ.Выбрать();
		
		Пока ВыборкаЗапросаПеренесенныхРТУ.Следующий() Цикл
			
			УстановитьПривилегированныйРежим(Истина);
			
			СтатусДоставки = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
			СтатусДоставки.Отбор.Объект.Установить(ВыборкаЗапросаПеренесенныхРТУ.РТУ);
			СтатусДоставки.Отбор.Свойство.Установить(ПланыВидовХарактеристик.СвойстваОбъектов.СтатусДоставки);
			
			СтатусДоставки.Прочитать(); 
			СтатусДоставки.Очистить();
			СтатусДоставки.Записать(); 
			
			//+КабановА.В. 25.03.2025 # UT10-5156 
			ВремяПередачи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
			ВремяПередачи.Отбор.Объект.Установить(ВыборкаЗапросаПеренесенныхРТУ.РТУ);
			ВремяПередачи.Отбор.Свойство.Установить(ПланыВидовХарактеристик.СвойстваОбъектов.ВремяПередачи);
			
			ВремяПередачи.Прочитать(); 
			ВремяПередачи.Очистить();
			ВремяПередачи.Записать();		
			//-КабановА.В. 25.03.2025 # UT10-5156 

			УстановитьПривилегированныйРежим(Ложь);
			
			Если ВыборкаЗапросаПеренесенныхРТУ.РТУ.БылаПечать Тогда
				
				РТУОбъект = ВыборкаЗапросаПеренесенныхРТУ.РТУ.Получитьобъект();
				РТУОбъект.БылаПечать = Ложь;
				//+Марков И. 13.08.2025 #UT10-5378
				РТУОбъект.ДополнительныеСвойства.Вставить("НеФормироватьИсходящееСообщение");
				//-Марков И. 13.08.2025 #UT10-5378 
				РТУОбъект.ОбменДанными.Загрузка = Истина;

				Попытка 
					РТУОбъект.Записать();
				Исключение
				КонецПопытки;
				
			КонецЕсли;

		КонецЦикла;
		
	КонецЕсли;
	
	ДатаВключенияТоваровНаДоставке	=	Константы.ДатаВключенияТоваровНаДоставке.Получить();
	
	Если (НЕ ЗНачениеЗаполнено(ДатаВключенияТоваровНаДоставке))
		ИЛИ (НачалоДня(ДатаВключенияТоваровНаДоставке) >  ЭтотОбъект.Дата) Тогда
		Возврат;
	Иначе
		
		// регистр ТоварыНаДоставке
		ТаблицаДвижений_ТоварыНаДоставке = РаботаСТоварамиНаДоставке.ЗаданияРеализацииНоменклатура_ПоЗаданию(ЭтотОбъект.Ссылка);
		ТаблицаДвижений_ТоварыНаДоставке.Колонки.Добавить("Период");
		ТаблицаДвижений_ТоварыНаДоставке.ЗаполнитьЗначения(ЭтотОбъект.Дата, "Период");
		Движения.ТоварыНаДоставке.Записывать = Истина;
		Движения.ТоварыНаДоставке.Загрузить(ТаблицаДвижений_ТоварыНаДоставке);
		
	КонецЕсли;
	
	
КонецПроцедуры

Функция НайтиКлиента(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаданиеНаДоставкуДоставкаПоказная.Контрагент
	|ИЗ
	|	Документ.ЗаданиеНаДоставку.ДоставкаПоказная КАК ЗаданиеНаДоставкуДоставкаПоказная
	|ГДЕ
	|	ЗаданиеНаДоставкуДоставкаПоказная.Контрагент = &Контрагент
	|	И ЗаданиеНаДоставкуДоставкаПоказная.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Истина;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Процедура ВыполнитьПослеВыбораОчередей(Список,ДопПараметры)  Экспорт 
	
	Если Список = Неопределено Тогда
		Возврат;    // Нажали кнопку "Отмена"
	КонецЕсли;
	
	ОчередьДоставки.Очистить();
	
	Для каждого ТекСтр Из Список Цикл
		
		Если ТекСтр.Пометка Тогда
			
			НоваяСтрока =  ОчередьДоставки.Добавить();
			НоваяСтрока.Очередь = ТекСтр.Значение;
			
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
	
	#Если Клиент Тогда	
		
		Если ЭтоНовый() Тогда
			
			Предупреждение("Документ можно распечатать только после его записи");
			Возврат;
			
		ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
			
			Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
			Возврат;
			
		КонецЕсли;
		
		Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
			Возврат;
		КонецЕсли;
		
		ЗапросГП = Новый Запрос;
		ЗапросГП.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ГоловнойКонтрагент = &ГоловнойКонтрагент
		|	И Контрагенты.Ссылка <> &ГоловнойКонтрагент"; 		
		
		Если Найти(ИмяМакета, "Макет") <> 0 Тогда
			
			Запрос= Новый Запрос;
			Запрос.Текст =  
			"ВЫБРАТЬ
			|	ЗаданиеНаДоставку.Дата,
			|	ЗаданиеНаДоставку.Номер,
			|	ЗаданиеНаДоставку.Маршрут,
			|	ЗаданиеНаДоставку.Водитель
			|ИЗ
			|	Документ.ЗаданиеНаДоставку КАК ЗаданиеНаДоставку
			|ГДЕ
			|	ЗаданиеНаДоставку.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка,
			|	МАКСИМУМ(РеализацияТоваровУслугТовары.ЗаказПокупателя.КроссДокинг) КАК ЗаказПокупателяКроссДокинг
			|ПОМЕСТИТЬ РеализацииКроссДокинг
			|ИЗ
			|	Документ.ЗаданиеНаДоставку.Доставка КАК ЗаданиеНаДоставкуДоставка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ДокументыСборкиЗаказов КАК РеализацияТоваровУслугДокументыСборкиЗаказов
			|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
			|			ПО РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка = РеализацияТоваровУслугТовары.Ссылка
			|		ПО ЗаданиеНаДоставкуДоставка.ДокументСборки = РеализацияТоваровУслугДокументыСборкиЗаказов.ДокументСборки
			|			И (РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.Проведен)
			|ГДЕ
			|	ЗаданиеНаДоставкуДоставка.Ссылка = &Ссылка
			|	И НЕ РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка ЕСТЬ NULL
			|
			|СГРУППИРОВАТЬ ПО
			|	РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЗаданиеНаДоставкуДоставка.Контрагент КАК Контрагент,
			|	Контрагенты.ПриоритетВМаршруте КАК ПриоритетВМаршруте,
			|	Контрагенты.ВремяПриемкиТовара КАК ГрафикРаботы,
			|	СУММА(ЗаданиеНаДоставкуДоставка.Количество) КАК Кол,
			|	ВЫРАЗИТЬ(ВЫБОР
			|			КОГДА АдресДоставки.Объект ЕСТЬ NULL
			|				ТОГДА """"
			|			ИНАЧЕ ВЫБОР
			|					КОГДА ПОДСТРОКА(АдресДоставки.Поле4, 1, 100) = """"
			|							И ПОДСТРОКА(АдресДоставки.Поле6, 1, 100) = """"
			|							И ПОДСТРОКА(АдресДоставки.Поле7, 1, 100) = """"
			|							И ПОДСТРОКА(АдресДоставки.Поле8, 1, 100) = """"
			|							И ПОДСТРОКА(АдресДоставки.Поле9, 1, 100) = """"
			|						ТОГДА АдресДоставки.Представление
			|					ИНАЧЕ АдресДоставки.Поле2 + "", "" + АдресДоставки.Поле3 + АдресДоставки.Поле4 + "" "" + АдресДоставки.Поле5 + "", "" + АдресДоставки.Поле6 + "", дом № "" + АдресДоставки.Поле7 + "" "" + ВЫБОР
			|							КОГДА ПОДСТРОКА(АдресДоставки.Поле8, 1, 100) = """"
			|								ТОГДА """"
			|							ИНАЧЕ "" корпус "" + АдресДоставки.Поле8
			|						КОНЕЦ + "" "" + ВЫБОР
			|							КОГДА ПОДСТРОКА(АдресДоставки.Поле9, 1, 100) = """"
			|								ТОГДА """"
			|							ИНАЧЕ "" оф."" + АдресДоставки.Поле9
			|						КОНЕЦ + """"
			|				КОНЕЦ
			|		КОНЕЦ КАК СТРОКА(999)) КАК АдресДоставки,
			|	ВЫРАЗИТЬ(ВЫБОР
			|			КОГДА ТелефонКонтрагента.Объект ЕСТЬ NULL
			|				ТОГДА """"
			|			ИНАЧЕ ТелефонКонтрагента.Представление
			|		КОНЕЦ КАК СТРОКА(100)) КАК Тел,
			|	ЕСТЬNULL(РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка, ЕСТЬNULL(СлужебнаяЗаписка.Ссылка, ОбъединениеГМВТЕ.Ссылка)) КАК Ссылка,
			|	ЕСТЬNULL(РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.Номер, ЕСТЬNULL(СлужебнаяЗаписка.Ссылка.Номер, ОбъединениеГМВТЕ.Ссылка.Номер)) КАК Номер,
			|	ЕСТЬNULL(ЗаданиеНаДоставкуДоставка.ДокументСборки.Договор.ОплатаПоДоговоруНаличными, ЛОЖЬ) КАК ОплатаНаличными,
			|	ВЫБОР
			|		КОГДА ЗаданиеНаДоставкуДоставка.Возврат = ИСТИНА
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Возврат,
			|	МИНИМУМ(ЗаданиеНаДоставкуДоставка.НомерСтроки) КАК НомерСтроки,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(РеализацииКроссДокинг.ЗаказПокупателяКроссДокинг, ЛОЖЬ) = ИСТИНА
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЗаданиеНаДоставкуДоставка.Контрагент.ОформлятьРеализацииКакВнутреннееПеремещение
			|	КОНЕЦ КАК КроссДокинг,
			|	ЕСТЬNULL(РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.ДоговорКонтрагента.РаботаетБезПечати, ЛОЖЬ) КАК РаботаетБезПечати
			|ИЗ
			|	Документ.ЗаданиеНаДоставку.Доставка КАК ЗаданиеНаДоставкуДоставка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
			|		ПО ЗаданиеНаДоставкуДоставка.Контрагент = Контрагенты.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресДоставки
			|		ПО (АдресДоставки.Объект = Контрагенты.Ссылка)
			|			И (АдресДоставки.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
			|			И (АдресДоставки.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента))
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ТелефонКонтрагента
			|		ПО (ТелефонКонтрагента.Объект = Контрагенты.Ссылка)
			|			И (ТелефонКонтрагента.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
			|			И (ТелефонКонтрагента.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента))
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ДокументыСборкиЗаказов КАК РеализацияТоваровУслугДокументыСборкиЗаказов
			|			ЛЕВОЕ СОЕДИНЕНИЕ РеализацииКроссДокинг КАК РеализацииКроссДокинг
			|			ПО РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка = РеализацииКроссДокинг.Ссылка
			|		ПО ЗаданиеНаДоставкуДоставка.ДокументСборки = РеализацияТоваровУслугДокументыСборкиЗаказов.ДокументСборки
			|			И (РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.Проведен)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СлужебнаяЗаписка КАК СлужебнаяЗаписка
			|		ПО ЗаданиеНаДоставкуДоставка.ДокументСборки = СлужебнаяЗаписка.Ссылка
			|			И (СлужебнаяЗаписка.Проведен)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОбъединениеГМВТЕ КАК ОбъединениеГМВТЕ
			|		ПО ЗаданиеНаДоставкуДоставка.ДокументСборки = ОбъединениеГМВТЕ.Ссылка
			|			И (ОбъединениеГМВТЕ.Проведен)
			|ГДЕ
			|	ЗаданиеНаДоставкуДоставка.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗаданиеНаДоставкуДоставка.Контрагент,
			|	Контрагенты.ПриоритетВМаршруте,
			|	Контрагенты.ВремяПриемкиТовара,
			|	ВЫРАЗИТЬ(ВЫБОР
			|			КОГДА ТелефонКонтрагента.Объект ЕСТЬ NULL
			|				ТОГДА """"
			|			ИНАЧЕ ТелефонКонтрагента.Представление
			|		КОНЕЦ КАК СТРОКА(100)),
			|	ЕСТЬNULL(ЗаданиеНаДоставкуДоставка.ДокументСборки.Договор.ОплатаПоДоговоруНаличными, ЛОЖЬ),
			|	ВЫБОР
			|		КОГДА ЗаданиеНаДоставкуДоставка.Возврат = ИСТИНА
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ,
			|	ВЫРАЗИТЬ(ВЫБОР
			|			КОГДА АдресДоставки.Объект ЕСТЬ NULL
			|				ТОГДА """"
			|			ИНАЧЕ ВЫБОР
			|					КОГДА ПОДСТРОКА(АдресДоставки.Поле4, 1, 100) = """"
			|							И ПОДСТРОКА(АдресДоставки.Поле6, 1, 100) = """"
			|							И ПОДСТРОКА(АдресДоставки.Поле7, 1, 100) = """"
			|							И ПОДСТРОКА(АдресДоставки.Поле8, 1, 100) = """"
			|							И ПОДСТРОКА(АдресДоставки.Поле9, 1, 100) = """"
			|						ТОГДА АдресДоставки.Представление
			|					ИНАЧЕ АдресДоставки.Поле2 + "", "" + АдресДоставки.Поле3 + АдресДоставки.Поле4 + "" "" + АдресДоставки.Поле5 + "", "" + АдресДоставки.Поле6 + "", дом № "" + АдресДоставки.Поле7 + "" "" + ВЫБОР
			|							КОГДА ПОДСТРОКА(АдресДоставки.Поле8, 1, 100) = """"
			|								ТОГДА """"
			|							ИНАЧЕ "" корпус "" + АдресДоставки.Поле8
			|						КОНЕЦ + "" "" + ВЫБОР
			|							КОГДА ПОДСТРОКА(АдресДоставки.Поле9, 1, 100) = """"
			|								ТОГДА """"
			|							ИНАЧЕ "" оф."" + АдресДоставки.Поле9
			|						КОНЕЦ + """"
			|				КОНЕЦ
			|		КОНЕЦ КАК СТРОКА(999)),
			|	ЕСТЬNULL(РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка, ЕСТЬNULL(СлужебнаяЗаписка.Ссылка, ОбъединениеГМВТЕ.Ссылка)),
			|	ЕСТЬNULL(РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.Номер, ЕСТЬNULL(СлужебнаяЗаписка.Ссылка.Номер, ОбъединениеГМВТЕ.Ссылка.Номер)),
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(РеализацииКроссДокинг.ЗаказПокупателяКроссДокинг, ЛОЖЬ) = ИСТИНА
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЗаданиеНаДоставкуДоставка.Контрагент.ОформлятьРеализацииКакВнутреннееПеремещение
			|	КОНЕЦ,
			|	ЕСТЬNULL(РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.ДоговорКонтрагента.РаботаетБезПечати, ЛОЖЬ)
			|
			|УПОРЯДОЧИТЬ ПО
			|	#Порядок#
			|ИТОГИ
			|	МАКСИМУМ(ПриоритетВМаршруте),
			|	МАКСИМУМ(ГрафикРаботы),
			|	СУММА(Кол),
			|	МАКСИМУМ(АдресДоставки),
			|	МАКСИМУМ(Тел),
			|	МАКСИМУМ(Возврат)
			|ПО
			|	Контрагент
			|АВТОУПОРЯДОЧИВАНИЕ" ;
			
			Если Константы.База.Получить() = Перечисления.НазваниеБазы.Восток Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"#Порядок#","	АдресДоставки ");
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"#Порядок#","	НомерСтроки ");
			КонецЕсли;
			
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			Пакет = Запрос.ВыполнитьПакет();
			ЗапросШапка = Пакет[0].Выгрузить();
			
			//   Чтобы не ошибиться в запросе и не менять логику  отдельным запросом сформирую таблицу с номерами УПД
			ТЗ_РезультатЗапроса =   Пакет[2].Выгрузить();
			МассивДокументовРеализация  = Новый Массив;
			//+Марков И. 09.04.2025 #UT10-5181
			МассивОбъединенийГМВТЕ  = Новый Массив;
			
			Для каждого ТекСтр Из ТЗ_РезультатЗапроса Цикл
				
				Если ЗначениеЗаполнено(ТекСтр.Ссылка) И ТипЗнч(ТекСтр.Ссылка) = Тип("ДокументСсылка.ОбъединениеГМВТЕ") Тогда 
					МассивОбъединенийГМВТЕ.Добавить(ТекСтр.Ссылка);		
				ИначеЕсли ЗначениеЗаполнено(ТекСтр.Ссылка) Тогда
					МассивДокументовРеализация.Добавить(ТекСтр.Ссылка);
				КонецЕсли;
				
			КонецЦикла; 
			//-Марков И. 09.04.2025 #UT10-5181
			
			//+Гавриленков В. 12.04.2025 #UT10-5186 Добавлено условие МассивОбъединенийГМВТЕ.Количество() > 0
			Если МассивДокументовРеализация.Количество() > 0 Или МассивОбъединенийГМВТЕ.Количество() > 0 Тогда 				
				
				Запрос = Новый Запрос;
				//Марков И. 09.04.2025 #UT10-5181 Добавлена логика для ОбъединенияГМВТЕ
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ОбъединениеГМВТЕТранспортныеЕдиницы.Ссылка КАК Объединение,
				|	РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка КАК Реализация
				|ПОМЕСТИТЬ ВТ_ОбъединенияИРеализации
				|ИЗ
				|	Документ.ОбъединениеГМВТЕ.ТранспортныеЕдиницы КАК ОбъединениеГМВТЕТранспортныеЕдиницы
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ДокументыСборкиЗаказов КАК РеализацияТоваровУслугДокументыСборкиЗаказов
				|		ПО ОбъединениеГМВТЕТранспортныеЕдиницы.ГрузовоеМесто.Сборка = РеализацияТоваровУслугДокументыСборкиЗаказов.ДокументСборки
				|ГДЕ
				|	ОбъединениеГМВТЕТранспортныеЕдиницы.Ссылка В(&СписокОбъединений)
				|
				|СГРУППИРОВАТЬ ПО
				|	РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка,
				|	ОбъединениеГМВТЕТранспортныеЕдиницы.Ссылка
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	СчетФактураВыданный.Номер КАК Номер,
				|	СчетФактураВыданный.ДокументОснование
				|ИЗ
				|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
				|ГДЕ
				|	СчетФактураВыданный.Проведен
				|	И СчетФактураВыданный.ДокументОснование В(&ДокументОснование)
				|	И НЕ СчетФактураВыданный.ДоговорКонтрагента.РозничнаяПродажа
				|	И НЕ СчетФактураВыданный.ДоговорКонтрагента.ЛицевойСчет
				|
				|СГРУППИРОВАТЬ ПО
				|	СчетФактураВыданный.Номер,
				|	СчетФактураВыданный.ДокументОснование
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	СчетФактураВыданный.Номер,
				|	ВТ_ОбъединенияИРеализации.Объединение
				|ИЗ
				|	ВТ_ОбъединенияИРеализации КАК ВТ_ОбъединенияИРеализации
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
				|		ПО ВТ_ОбъединенияИРеализации.Реализация = СчетФактураВыданный.ДокументОснование
				|ГДЕ
				|	СчетФактураВыданный.Проведен
				|	И НЕ СчетФактураВыданный.ДоговорКонтрагента.РозничнаяПродажа
				|	И НЕ СчетФактураВыданный.ДоговорКонтрагента.ЛицевойСчет
				|
				|СГРУППИРОВАТЬ ПО
				|	СчетФактураВыданный.Номер,
				|	ВТ_ОбъединенияИРеализации.Объединение"; 				
				
				Запрос.УстановитьПараметр("ДокументОснование", МассивДокументовРеализация);
				Запрос.УстановитьПараметр("СписокОбъединений", МассивОбъединенийГМВТЕ);
				СчетФактуры = Запрос.Выполнить().Выгрузить();
				
				ЗапросГМ = Новый Запрос;
				ЗапросГМ.Текст =
				"ВЫБРАТЬ
				|	РеализацияТоваровУслугТовары.Ссылка
				|ПОМЕСТИТЬ РеаализацииКД
				|ИЗ
				|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
				|ГДЕ
				|	РеализацияТоваровУслугТовары.Ссылка В(&Ссылка)
				|	И (РеализацияТоваровУслугТовары.ЗаказПокупателя.КроссДокинг
				|			ИЛИ РеализацияТоваровУслугТовары.Ссылка.Грузополучатель.ОформлятьРеализацииКакВнутреннееПеремещение
				|			ИЛИ РеализацияТоваровУслугТовары.Ссылка.Грузополучатель.ТранзитЧерезТомилино)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	РеализацияТоваровУслугДокументыСборкиЗаказов.ДокументСборки,
				|	РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка
				|ПОМЕСТИТЬ Сборки
				|ИЗ
				|	РеаализацииКД КАК РеаализацииКД
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ДокументыСборкиЗаказов КАК РеализацияТоваровУслугДокументыСборкиЗаказов
				|		ПО РеаализацииКД.Ссылка = РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ГрузовоеМесто.Ссылка КАК Грузоместо,
				|	Сборки.Ссылка КАК Реализация
				|ИЗ
				|	Сборки КАК Сборки
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ГрузовоеМесто КАК ГрузовоеМесто
				|		ПО Сборки.ДокументСборки = ГрузовоеМесто.Сборка
				|			И (НЕ ГрузовоеМесто.ПометкаУдаления)
				|ГДЕ
				|	НЕ ГрузовоеМесто.Ссылка ЕСТЬ NULL";
				
				ЗапросГМ.УстановитьПараметр("Ссылка", МассивДокументовРеализация); 				
				ГрузоМеста = ЗапросГМ.Выполнить().Выгрузить(); 
				
				//+Марков И. 09.04.2025 #UT10-5181
				ЗапросТЕ = Новый Запрос;
				ЗапросТЕ.Текст =
				"ВЫБРАТЬ
				|	ОбъединениеГМВТЕТранспортныеЕдиницы.Ссылка КАК Объединение,
				|	ОбъединениеГМВТЕТранспортныеЕдиницы.ТранспортнаяЕдиница КАК ТЕ
				|ИЗ
				|	Документ.ОбъединениеГМВТЕ.ТранспортныеЕдиницы КАК ОбъединениеГМВТЕТранспортныеЕдиницы
				|ГДЕ
				|	ОбъединениеГМВТЕТранспортныеЕдиницы.Ссылка В (&СписокОбъединений)
				|
				|СГРУППИРОВАТЬ ПО
				|	ОбъединениеГМВТЕТранспортныеЕдиницы.Ссылка,
				|	ОбъединениеГМВТЕТранспортныеЕдиницы.ТранспортнаяЕдиница";
				
				ЗапросТЕ.УстановитьПараметр("СписокОбъединений", МассивОбъединенийГМВТЕ); 				
				ТранспортныеЕдиницы = ЗапросТЕ.Выполнить().Выгрузить();
				//-Марков И. 09.04.2025 #UT10-5181
				
			Иначе 
				
				СчетФактуры = Неопределено;
				ГрузоМеста  = Неопределено;
				//+Марков И. 09.04.2025 #UT10-5181
				ТранспортныеЕдиницы = Неопределено;
				//-Марков И. 09.04.2025 #UT10-5181
				
			КонецЕсли;
			
			ЗК = Пакет[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			//---
			ТабДок = Новый ТабличныйДокумент;
			ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаданиеНаДоставку_ЛистРазвоза";
			
			Макет = ПолучитьМакет("МакетГУИД");
			
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			
			Шапка = ЗапросШапка[0];
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			ОбластьМакета.Параметры.Дата = Формат(Шапка.Дата, "ДЛФ=D");
			
			ТекстОчереди = "";
			
			Для Каждого СтрОчереди ИЗ ОчередьДоставки Цикл
				ТекстОчереди = ТекстОчереди+СтрОчереди.Очередь + ", ";
			КонецЦикла;
			
			ТекстОчереди = Лев(ТекстОчереди, СтрДлина(ТекстОчереди) - 2);
			ОбластьМакета.Параметры.Очереди = ТекстОчереди;
			
			ТабДок.Вывести(ОбластьМакета);
			ВсегоДокументов = 0;
			ТекНом = 0;
			
			Пока ЗК.Следующий() Цикл
				
				ЗапросКонтрагенты = ЗК.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				//---	
				Пока ЗапросКонтрагенты.Следующий() Цикл
					
					ТекстВозврат = "";
					
					Если ЗК.Возврат = 1 Тогда 
						
						Если ЗапросКонтрагенты.Возврат = 1  Тогда 
							// не выводим строчку возврата
							Продолжить;
						Иначе
							ТекстВозврат = "Да";
							// но о том, что по конрагенту есть возврат, отметим
						КонецЕсли;
						
					КонецЕсли;
					
					
					ОбластьМакета = Макет.ПолучитьОбласть("Строка");
					ОбластьМакета.Параметры.Заполнить(ЗапросКонтрагенты);  
					
					Если ЗапросКонтрагенты.АдресДоставки = "" Или ЗапросКонтрагенты.Тел = "" Тогда
						
						ЗапросГП.УстановитьПараметр("ГоловнойКонтрагент",ЗапросКонтрагенты.Контрагент);
						РезультатГП = ЗапросГП.Выполнить();
						
						Если НЕ РезультатГП.Пустой() Тогда
							
							ВыборкаГП = РезультатГП.Выбрать();
							ВыборкаГП.Следующий();
							
							Если ЗапросКонтрагенты.АдресДоставки = "" Тогда
								ОбластьМакета.Параметры.АдресДоставки = МСК.ПолучитьАдресДоставки(ВыборкаГП.Ссылка);
							КонецЕсли;
							
							Если ЗапросКонтрагенты.Тел = "" Тогда
								ОбластьМакета.Параметры.Тел = МСК.ПолучитьТелефоны(ВыборкаГП.Ссылка);
							КонецЕсли; 			
							
						КонецЕсли;			
						
					КонецЕсли;		
					
					ОбластьМакета.Параметры.Возврат = ТекстВозврат;
					ОбластьМакета.Параметры.РаботаетБезПечати = ?(ЗапросКонтрагенты.РаботаетБезПечати, "Да", "");

					ТекНом = ТекНом + 1;
					ОбластьМакета.Параметры.Сч =  ТекНом;
					ПечСписокДокументов = "";
					ПечОплатаНаличными = ?(ЗапросКонтрагенты.ОплатаНаличными, "Да", "");
					
					ЗапросДок = ЗапросКонтрагенты.Выбрать();
					
					Пока ЗапросДок.Следующий() Цикл
						
						ПечСписокДокументов = ПечСписокДокументов + ?(ЗначениеЗаполнено(ПечСписокДокументов), Символы.ПС, "") + СокрЛП(ЗапросДок.Номер);
						ВсегоДокументов = ВсегоДокументов+1;
						
						Если ЗапросДок.ОплатаНаличными Тогда 
							ПечОплатаНаличными = "Да";
						КонецЕсли;	
						
					КонецЦикла;
					
					Если ЗапросКонтрагенты.Контрагент.ТранзитЧерезТомилино Тогда
						
						ПечСписокДокументов = "";
						
						Если НЕ ГрузоМеста = Неопределено Тогда  
							
							ЕстьСтрокиСГМ = ГрузоМеста.НайтиСтроки(Новый Структура("Реализация",ЗапросКонтрагенты.Ссылка));
							ПервоеГМ = Истина;
							
							Если НЕ ЕстьСтрокиСГМ.Количество() = 0 Тогда
								
								Для Каждого СтрокаСГМ Из ЕстьСтрокиСГМ Цикл
									
									ПечСписокДокументов = ПечСписокДокументов + ?(ПервоеГМ, "", ",") + " ГМ" 
									+ ОбщегоНазначения.ПолучитьНомерНаПечать(СтрокаСГМ.Грузоместо,,,Истина);
									
									Если ПервоеГМ Тогда 
										ПервоеГМ = Ложь; 
									КонецЕсли;  
									
								КонецЦикла;	
								
							КонецЕсли;
							
						КонецЕсли;    
						
						//+Марков И. 09.04.2025 #UT10-5181
						Если НЕ ТранспортныеЕдиницы = Неопределено Тогда  
							
							ЕстьСтрокиСТЕ = ТранспортныеЕдиницы.НайтиСтроки(Новый Структура("Объединение",ЗапросКонтрагенты.Ссылка));
							ПервоеТЕ = Истина;
							
							Если НЕ ЕстьСтрокиСТЕ.Количество() = 0 Тогда
								
								ПечСписокДокументов = "";
								
								Для Каждого СтрокаСТЕ Из ЕстьСтрокиСТЕ Цикл
									
									ПечСписокДокументов = ПечСписокДокументов + ?(ПервоеТЕ, "", ",") + " ТЕ" 
									+ ОбщегоНазначения.ПолучитьНомерНаПечать(СтрокаСТЕ.ТЕ,,,Истина);
									
									Если ПервоеТЕ Тогда 
										ПервоеТЕ = Ложь; 
									КонецЕсли;  
									
								КонецЦикла;	
								
							КонецЕсли;
							
						КонецЕсли; 
						//-Марков И. 09.04.2025 #UT10-5181
						
						Если СчетФактуры <> Неопределено Тогда
							
							СтрокаТЗ =  СчетФактуры.Найти(ЗапросКонтрагенты.Ссылка);   
							
							Если СтрокаТЗ <> Неопределено Тогда   							
								ПечСписокДокументов = "УПД " + СтрокаТЗ.Номер + " (" + ПечСписокДокументов + ")";    								
							КонецЕсли;
							
						КонецЕсли;
						
					ИначеЕсли ЗапросКонтрагенты.КроссДокинг  Тогда
						
						Если ЗапросКонтрагенты.Контрагент.ОформлятьРеализацииКакВнутреннееПеремещение Тогда
							
							ПечСписокДокументов = ПечСписокДокументов + ?(ЗначениеЗаполнено(ПечСписокДокументов), "", ?(ТипЗнч(ЗапросКонтрагенты.Ссылка) = Тип("ДокументСсылка.СлужебнаяЗаписка"),"Сл.зап.№ ","")+ СокрЛП(ЗапросКонтрагенты.Номер)+" ");  
							
							Если СчетФактуры <> Неопределено Тогда 
								
								СтрокаТЗ =  СчетФактуры.Найти(ЗапросКонтрагенты.Ссылка);
								
								Если  СтрокаТЗ <> Неопределено Тогда 
									ПечСписокДокументов = ПечСписокДокументов + " (УПД " +	СтрокаТЗ.Номер + ")";
								КонецЕсли;
								
							КонецЕсли;
							
							ПечСписокДокументов = ПечСписокДокументов +"(";
							
						КонецЕсли;     						
						
						Если НЕ ГрузоМеста = Неопределено Тогда
							
							ЕстьСтрокиСГМ = ГрузоМеста.НайтиСтроки(Новый Структура("Реализация", ЗапросКонтрагенты.Ссылка));
							ПервоеГМ = Истина;
							
							Если НЕ ЕстьСтрокиСГМ.Количество() = 0 Тогда
								
								Для Каждого СтрокаСГМ Из ЕстьСтрокиСГМ Цикл
									
									ПечСписокДокументов = ПечСписокДокументов +?(ПервоеГМ, "", ",") + " ГМ" 
									+ ОбщегоНазначения.ПолучитьНомерНаПечать(СтрокаСГМ.Грузоместо,,, Истина);
									
									Если ПервоеГМ Тогда 
										ПервоеГМ = Ложь; 
									КонецЕсли;  									
									
								КонецЦикла;																
								
							КонецЕсли;
							
						КонецЕсли;
						
						Если ТипЗнч(ЗапросКонтрагенты.Ссылка) = Тип("ДокументСсылка.СлужебнаяЗаписка") Тогда 
							
							ПервоеГМ = Истина;  
							
							Для Каждого СтрокаСГМ Из ЗапросКонтрагенты.Ссылка.ТранспортныеЕдиницы Цикл
								
								ПечСписокДокументов = ПечСписокДокументов +?(ПервоеГМ, "", ",") + СокрЛП(СтрокаСГМ.Грузоместо);
								
								Если ПервоеГМ Тогда 
									ПервоеГМ = Ложь; 
								КонецЕсли;  									
								
							КонецЦикла;	
							
						КонецЕсли;
						
						Если ЗапросКонтрагенты.Контрагент.ОформлятьРеализацииКакВнутреннееПеремещение Тогда
							ПечСписокДокументов  = ПечСписокДокументов + ")"; 
						КонецЕсли;						
						
					Иначе
						
						ПечСписокДокументов = ПечСписокДокументов + ?(ЗначениеЗаполнено(ПечСписокДокументов), "", ?(ТипЗнч(ЗапросКонтрагенты.Ссылка) = Тип("ДокументСсылка.СлужебнаяЗаписка"),"Сл.зап.№ ","")+СокрЛП(ЗапросКонтрагенты.Номер)+" ");  
						
						Если СчетФактуры <> Неопределено Тогда 
							
							СтрокаТЗ =  СчетФактуры.Найти(ЗапросКонтрагенты.Ссылка);
							
							Если  СтрокаТЗ <> Неопределено Тогда 
								ПечСписокДокументов = ПечСписокДокументов + " (УПД " + СтрокаТЗ.Номер + ")";
							КонецЕсли;
							
						КонецЕсли;
						
						Если ТипЗнч(ЗапросКонтрагенты.Ссылка) = Тип("ДокументСсылка.СлужебнаяЗаписка") Тогда 
							
							ПервоеГМ = Истина;
							ПечСписокДокументов = ПечСписокДокументов+"("; 
							
							Для Каждого СтрокаСГМ Из ЗапросКонтрагенты.Ссылка.ТранспортныеЕдиницы Цикл
								
								ПечСписокДокументов = ПечСписокДокументов +?(ПервоеГМ, "", ",")	+ СокрЛП(СтрокаСГМ.Грузоместо);
								
								Если ПервоеГМ Тогда 
									ПервоеГМ = Ложь; 
								КонецЕсли;  									
								
							КонецЦикла;	
							
							ПечСписокДокументов = ПечСписокДокументов+")";
							
						КонецЕсли;
						
					КонецЕсли;					
					
					ОбластьМакета.Параметры.СписокДокументов 	= ПечСписокДокументов;
					ОбластьМакета.Параметры.ОплатаНаличными 	= ПечОплатаНаличными;
					ТабДок.Вывести(ОбластьМакета);
					
				КонецЦикла;
				
			КонецЦикла;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Итого");
			ОбластьМакета.Параметры.Всего = Доставка.Итог("Количество") - Доставка.Итог("Возврат");
			ОбластьМакета.Параметры.Водила = Водитель;
			ОбластьМакета.Параметры.ВсегоДокументов = ВсегоДокументов;
			ТабДок.Вывести(ОбластьМакета);
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЗаданиеНаДоставкуДоставка.Контрагент,
			|	ЗаданиеНаДоставкуДоставка.ДокументСборки
			|ПОМЕСТИТЬ ВозвратыДоставка
			|ИЗ
			|	Документ.ЗаданиеНаДоставку.Доставка КАК ЗаданиеНаДоставкуДоставка
			|ГДЕ
			|	ЗаданиеНаДоставкуДоставка.Ссылка = &Ссылка
			|	И ЗаданиеНаДоставкуДоставка.Возврат
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВозвратыДоставка.Контрагент КАК Грузополучатель,
			|	ВозвратыДоставка.ДокументСборки КАК Документ,
			|	ВозвратыДоставка.ДокументСборки.Номер КАК НомерНакладной,
			|	ЗаявкаНаВозвратТовары.Номенклатура КАК Номенклатура,
			|	ЗаявкаНаВозвратТовары.Номенклатура.Родитель КАК Производитель,
			|	ЗаявкаНаВозвратТовары.Номенклатура.КодПроизводителя КАК КодПроизводителя,
			|	ЗаявкаНаВозвратТовары.Тип,
			|	ЗаявкаНаВозвратТовары.Комментарий,
			|	СУММА(ЗаявкаНаВозвратТовары.Количество) КАК Кол
			|ИЗ
			|	ВозвратыДоставка КАК ВозвратыДоставка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары
			|		ПО ВозвратыДоставка.ДокументСборки = ЗаявкаНаВозвратТовары.Ссылка
			|ГДЕ
			|	ВозвратыДоставка.ДокументСборки ССЫЛКА Документ.ЗаявкаНаВозврат
			|
			|СГРУППИРОВАТЬ ПО
			|	ВозвратыДоставка.Контрагент,
			|	ВозвратыДоставка.ДокументСборки,
			|	ВозвратыДоставка.ДокументСборки.Номер,
			|	ЗаявкаНаВозвратТовары.Номенклатура,
			|	ЗаявкаНаВозвратТовары.Номенклатура.Родитель,
			|	ЗаявкаНаВозвратТовары.Номенклатура.КодПроизводителя,
			|	ЗаявкаНаВозвратТовары.Тип,
			|	ЗаявкаНаВозвратТовары.Комментарий
			|
			|УПОРЯДОЧИТЬ ПО
			|	Грузополучатель,
			|	Документ,
			|	Номенклатура
			|АВТОУПОРЯДОЧИВАНИЕ";
			
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если НЕ РезультатЗапроса.Пустой() Тогда 
				
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаВозвраты");
				ТабДок.Вывести(ОбластьМакета);
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				ТекГрузополучатель = "!!!";
				ТекГрузополучательТекст = "";
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					Если ТекГрузополучатель <> ВыборкаДетальныеЗаписи.Грузополучатель Тогда
						
						ТекГрузополучатель = ВыборкаДетальныеЗаписи.Грузополучатель;
						ТекГрузополучательТекст = ВыборкаДетальныеЗаписи.Грузополучатель.Наименование;
						
					Иначе
						ТекГрузополучательТекст = "";
					КонецЕсли;
					
					ОбластьМакета = Макет.ПолучитьОбласть("СтрВозвраты");
					ОбластьМакета.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
					ОбластьМакета.Параметры.ТекГрузополучательТекст = ТекГрузополучательТекст;
					ТабДок.Вывести(ОбластьМакета);
					
				КонецЦикла;
				
				Для нн = 1 По 3 Цикл
					
					ОбластьМакета = Макет.ПолучитьОбласть("СтрВозвратыПустая");
					ТабДок.Вывести(ОбластьМакета);
					
				КонецЦикла;
				
			КонецЕсли;
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Деньги", Истина);
			НайденныеСтроки = ЭтотОбъект.ДоставкаПоказная.НайтиСтроки(СтруктураОтбора);
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаДеньги");			
				ТабДок.Вывести(ОбластьМакета);
				
				ОбластьМакета = Макет.ПолучитьОбласть("СтрДеньги");
				
				Для каждого СтрокаДенег Из НайденныеСтроки Цикл
					
					ОбластьМакета.Параметры.Контрагент = СтрокаДенег.Контрагент;
					ПромАдресДоставки = МСК.ПолучитьАдресДоставки(СтрокаДенег.Контрагент);
					ПромТелефон       = МСК.ПолучитьТелефоны(СтрокаДенег.Контрагент); 				
					
					Если ПромАдресДоставки = "" Или ПромТелефон = "" Тогда
						
						ЗапросГП.УстановитьПараметр("ГоловнойКонтрагент", СтрокаДенег.Контрагент);
						РезультатГП = ЗапросГП.Выполнить();
						
						Если НЕ РезультатГП.Пустой() Тогда
							
							ВыборкаГП = РезультатГП.Выбрать();
							ВыборкаГП.Следующий();
							
							Если ПромАдресДоставки = "" Тогда
								ПромАдресДоставки = МСК.ПолучитьАдресДоставки(ВыборкаГП.Ссылка);
							КонецЕсли;
							
							Если ПромТелефон = "" Тогда
								ПромТелефон = МСК.ПолучитьТелефоны(ВыборкаГП.Ссылка);
							КонецЕсли; 			
							
						КонецЕсли;			
						
					КонецЕсли;
					
					ОбластьМакета.Параметры.АдресДоставки = ПромАдресДоставки; 
					ОбластьМакета.Параметры.Тел = ПромТелефон;				
					ТабДок.Вывести(ОбластьМакета);				
					
				КонецЦикла;			
				
			КонецЕсли; 	
			
			ОбластьШК = Макет.ПолучитьОбласть("ШтрихКод");		
			ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабДок, Макет, ОбластьШК, Ссылка);  		
			ТабДок.Вывести(ОбластьШК); 
			
			ТабДок.ОтображатьСетку = Ложь;
			ТабДок.ФиксацияСверху = 2;
			ТабДок.ПолеСлева = 1;
			ТабДок.ПолеСправа = 0;
			ТабДок.АвтоМасштаб = Истина;
			ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
			
		КонецЕсли;
		
		УниверсальныеМеханизмы.НапечататьДокумент(ТабДок, КоличествоЭкземпляров, НаПринтер, 
		ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, ЭтотОбъект.Метаданные().Представление()), Ссылка);
	#КонецЕсли

КонецПроцедуры 

Функция ПолучитьЗначениеТипаШтрихкодаДляЭУ(ТипКода)
	
	Перем Значение;
	
	Если ТипКода = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN8 Тогда
		Значение = 0;
	ИначеЕсли ТипКода = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13 Тогда
		Значение = 1;
	ИначеЕсли ТипКода = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN128 Тогда
		Значение = 2;
	ИначеЕсли ТипКода = ПланыВидовХарактеристик.ТипыШтрихкодов.Code39 Тогда
		Значение = 3;
	ИначеЕсли ТипКода = ПланыВидовХарактеристик.ТипыШтрихкодов.Code128 Тогда
		Значение = 4;
	Иначе
		Значение = -1;
	КонецЕсли;
	
	Возврат Значение;
КонецФункции // ПолучитьЗначениеТипаШтрихкодаДляЭУ()

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;
	СтруктураМакетов.Вставить("Макет", "Лист развоза");
	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОчередьДоставки.Количество()= 0 Тогда 
		
		Сообщить("Необходимо выбрать хотя бы одну очередь доставки!");
		Отказ = Истина;
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Для Каждого Строка из Доставка Цикл
		
		Если Строка.Возврат тогда
			
			ДокОб = СТрока.ДокументСборки.ПолучитьОбъект();
			ДокОб.статус = "Согласован";
			ДокОб.ДополнительныеСвойства.Вставить("НеВыполнятьПроверкуНаДатыЗапрета",Истина);
			ДокОб.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПроверитьГрузополучателейНаПечатьТТН(ДокументОбъект) Экспорт
	
	Результат = Новый Структура("Результат, КоличествоАвто, Автомобиль, ЕстьПризнакТТН", Истина, 0, Неопределено, Ложь);	
	
	Если Доставка.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли; 	
	
	ТЗГрузополучатели = ДокументОбъект.ДоставкаПоказная.Выгрузить(, "Контрагент");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Грузополучатели.Контрагент
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ВТ КАК Грузополучатели
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.ПечатьТТН,
	|	ВТ.Контрагент
	|ИЗ
	|	ВТ КАК ВТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ВТ.Контрагент = Контрагенты.Ссылка
	|ГДЕ
	|	Контрагенты.ПечатьТТН = ИСТИНА";
	
	Запрос.УстановитьПараметр("ВТ", ТЗГрузополучатели);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Количество() = 0 Тогда
		Возврат Результат;
	Иначе
		Результат.ЕстьПризнакТТН = Истина;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Водитель) Тогда
		
		Результат.Результат = Ложь;
		
		#Если Клиент Тогда
			Предупреждение("Поле водитель не заполнено!");
			Сообщить("Печать комплекта документа невозможна");
			Сообщить("Заполните поле водитель в документе, т.к.");
			
			Пока РезультатЗапроса.Следующий() Цикл
				Сообщить("У грузполучателя " + РезультатЗапроса.Контрагент + " установлен признак ""Печатать ТТН""");
			КонецЦикла;
		#КонецЕсли	
		
		Возврат Результат;		
		
	Иначе                 		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТранспортныеСредства.Ссылка,
		|	ТранспортныеСредства.РегистрационныйНомер,
		|	ТранспортныеСредства.ТранспортнаяКомпания,
		|	ТранспортныеСредства.Владелец
		|ИЗ
		|	Справочник.ТранспортныеСредства КАК ТранспортныеСредства
		|ГДЕ
		|	ТранспортныеСредства.Владелец = &Владелец
		|	И НЕ ТранспортныеСредства.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("Владелец", Водитель);
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		
		Если РезультатЗапроса.Количество() = 0 Тогда
			
			Результат.Результат = Ложь;
			Сообщить("Печать комплекта документа будет произведена без ТТН");
			Сообщить("У водителя " + Водитель + " не указано транспортное средство");
			Возврат Результат;
			
		КонецЕсли;               
		
		Результат.Результат = Истина;
		Результат.КоличествоАвто = РезультатЗапроса.Количество();
		РезультатЗапроса.Следующий();
		Результат.Автомобиль = РезультатЗапроса.Ссылка;
		
	КонецЕсли; 
	
	Возврат Результат; 
	
КонецФункции
